prenaissance/pbl_iot_team6/device-soft/ESP32/src/main.cpp
#include <Arduino.h>
#include <ArduinoJson.h>

#include "BluetoothSerial.h"
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <HTTPClient.h>

#include <MFRC522.h>
#include <SPI.h>

#include <ESP32Time.h>

#include <LiquidCrystal_I2C.h>
#include <ESP32Servo.h>
#include <Preferences.h>

#include <iomanip>
#include <sstream>

#include "drivers/dispenserDriver.h"
#include "drivers/lcdDriver.h"
#include "drivers/ledDriver.h"
#include "drivers/pickupSys.h"
#include "drivers/rfidDriver.h"
#include "./deviceData.h"
#include "./cert.h"

#define BAUD_RATE 9600

#define DD_TRANSM_SIZE 2048

#define SERVO_PIN 15

#define LED1_R 14
#define LED1_G 12

#define LED2_R 26
#define LED2_G 27

#define IR_PIN 13
#define PIEZO_PIN 32

#define I2C_ADDR 0x27
#define LCD_COLUMNS 16
#define LCD_LINES 2

#define SDA_PIN 21
#define SCL_PIN 22

#define SS_PIN 17
#define RST_PIN 4

#define BT_DEVICE "ESP32"

#define DEVICE_PARAM_NAMESPACE "device-param"
#define DEVICE_ID_SELECTOR "device-id"

// Use this buffer for f-output

char outputBuffer[256];

// Handler used for managing variables in nvm
Preferences preferences;

// Device's id SRAM storage and conversion functions

uint8_t deviceIdBytes[LCD_COLUMNS];
std::string deviceIdBase64 = "";

std::string uint8_tToHexString(const uint8_t *, size_t);
std::string uuid4Format(const std::string &);

// Peripherals' drivers & managers

LiquidCrystal_I2C lcd(I2C_ADDR, LCD_COLUMNS, LCD_LINES);
static LcdDriver ld(&lcd);

PiezoBuzzerDriver pd(PIEZO_PIN);
IR_SensDriver id(IR_PIN);

Servo motor;
static DispenserDriver dd(&motor);
static DispenceSequence ds(&dd);

static LedManager lm;

Rfid rfid;
static RfidDriver rm;

bool RFID_req;

// Device state SRAM storage and manip. functions

static DeviceData deviceData;

void saveData(JsonObject);
void checkSchedule(String);

// BT

#define BT_RFID_GET_REQ 1
#define BT_DUID_GET_REQ 2
#define BT_WIFI_SET_REQ 3
#define BT_DATA_UPD_REQ 4

static BluetoothSerial SerialBT;
String receivedMsg;

void bluetoothReqHandler(String);

// RTC

ESP32Time rtc(0);

// WiFi

bool switchToWiFi();
void switchToBT();

WiFiClientSecure wsClient;

#define WIFI_CONNECT_TIMEOUT 4000

char ssid[50];
char pass[50];
unsigned long conTimer;
unsigned long lastConAtt;

// TIME

#define TIME_SRC "http://worldtimeapi.org/api/ip/%s"

bool httpTimeUpd();

// HTTP

HTTPClient client;

#define PUB_IP_LOOKUP "http://api.ipify.org"

char ipStr[16];
void pubIP_lookup();

#define DEVICE_COMMON_ROUTE_PART "https://dispenser-backend.onrender.com/api/devices/%s"
#define DATA_ENDPOINT_PART "/config"
#define EVENT_ENDPOINT_PART "/event"

#define CREATE_EVENT_PARAMS_FMT "?eventType=%s&eventData=%s"
#define CREATE_EVENT_PARAMS_FMT_TRAILER "&profileId=%d"

#define EVENT_FMT "{\"eventType\":\"%s\",\"eventData\":\"%s\"}"
#define EVENT_ASSIGNMENT_TRAILER "\"profileId\":%d}"

void httpsDataUpd();
void httpsCreateEventViaPOST(String, String, unsigned int);
void httpsCreateEventViaGET(String, String, unsigned int);

StaticJsonDocument<DD_TRANSM_SIZE> json;

bool startupLog;

void setup()
{
    // INTERFACES

    Serial.begin(BAUD_RATE);
    Wire.begin();

    Serial.println("\n\nSetup logs:");

    // LCD

    ld.accessQueue()->enqueue(LcdMsg("    Setup...    ", "", 1, 1));
    ld.update();

    lcd.init();
    lcd.backlight();

    Serial.println("1. LCD setup - success");

    // GPIO

    pinMode(SERVO_PIN, OUTPUT);

    pinMode(LED1_R, OUTPUT);
    pinMode(LED1_G, OUTPUT);

    pinMode(LED2_R, OUTPUT);
    pinMode(LED2_G, OUTPUT);

    pinMode(IR_PIN, INPUT);
    pinMode(PIEZO_PIN, OUTPUT);

    Serial.println("2. GPIO setup - success");

    // Device's UUID

    preferences.begin(DEVICE_PARAM_NAMESPACE, false);
    String savedDeviceIdBase64 = preferences.getString(DEVICE_ID_SELECTOR, "");

    if (savedDeviceIdBase64 != "")
    {
        deviceIdBase64 = savedDeviceIdBase64.c_str();

        sprintf(outputBuffer, "3. Device UUID extracted: %s", deviceIdBase64.c_str());
        Serial.println(outputBuffer);
    }
    else
    {
        esp_fill_random(deviceIdBytes, sizeof(deviceIdBytes));
        deviceIdBase64 = uuid4Format(uint8_tToHexString(deviceIdBytes, 16));
        preferences.putString(DEVICE_ID_SELECTOR, deviceIdBase64.c_str());

        sprintf(outputBuffer, "3. Device UUID generated: %s", deviceIdBase64.c_str());
        Serial.println(outputBuffer);
    }

    preferences.end();

    // deviceIdBase64 = "11111111-1111-1111-1111-111111111111";
    deviceIdBase64 = "ae82af01-1cd2-4ee9-b9b6-fb38cb05b777";

    // Motor

    motor.attach(SERVO_PIN);

    Serial.println("4. Motor pinout set up successfully");

    // LED-s

    lm.init(LedDriver(LED1_R, LED1_G), 0);
    lm.update(0, 0);
    lm.init(LedDriver(LED2_R, LED2_G), 1);
    lm.update(0, 1);

    Serial.println("5. LED indication system initialized successfully");

    // RFID

    rfid.init(SS_PIN, RST_PIN);
    rm.init(&rfid);

    Serial.println("6. RFID manager initialized successfully");

    // BT

    SerialBT.begin(BT_DEVICE);

    Serial.println("7. BT operational");

    // WIFI

    wsClient.setCACert(cert_chain);

    Serial.println("8. WiFi Secure certificate set up");

    // FINISH

    startupLog = false;
    RFID_req = false;

    conTimer = 0;

    ld.accessQueue()->enqueue(LcdMsg("     Setup      ", "   finsihed!    ", 1, 1));
    ld.update();

    Serial.println("! Setup finished !\n");
}

void loop()
{
    while (SerialBT.available())
    {
        char incomingChar = SerialBT.read();

        if (incomingChar != '\n')
        {
            receivedMsg += String(incomingChar);
        }
        else
        {
            Serial.println("\nBT transmission received:");
            Serial.println(receivedMsg);
            bluetoothReqHandler(receivedMsg);
            receivedMsg = "";
        }
    }

    if (RFID_req)
    {
        if (rm.isNewCardRead())
        {
            rm.readUid();

            sprintf(outputBuffer, "Requested UUID: %s", rm.getCachedUid());
            Serial.println(outputBuffer);

            String RFID_data = rm.getCachedUid();

