prenaissance/pbl_iot_team6/device-soft/ESP32/src/main.cpp
            String response = "\"{\"resCode\":" + String(BT_RFID_GET_REQ) + ", \"payload\":{\"rfid\":\"" + RFID_data + "\"}}\"";
            SerialBT.println(response);

            char line[LCD_COLUMNS + 1];
            sprintf(line, "    %s    ", RFID_data);
            ld.accessQueue()->enqueue(LcdMsg("   Tag read:    ", line, 1, 1));

            Serial.println("Responded with RFID ID read");

            RFID_req = false;
        }
    }

    if (strlen(ssid) > 0 && strlen(pass) > 0)
    {
        bool timeCheck = rtc.getYear() > 1970;
        bool dataCheck = deviceData.getProfilesSize() > 0;
        bool ipCheck = strlen(ipStr) > 0;

        if (!timeCheck || !dataCheck || !ipCheck)
        {
            if (!ipCheck)
            {
                ld.accessQueue()->enqueue(LcdMsg("    Public IP   ", "     lookup     ", 1, 1));
                ld.update();
                Serial.println("Public ip is not known!");
                pubIP_lookup();
            }
            else if (!timeCheck)
            {
                ld.accessQueue()->enqueue(LcdMsg("    Datetime    ", "     lookup    ", 1, 1));
                ld.update();
                Serial.println("Time is not set up!");

                if (httpTimeUpd())
                {
                    std::string fmt1 = getTimeFmt(rtc.getHour(true) < 10, rtc.getMinute() < 10);
                    std::string fmt2 = getDateFmt(rtc.getDay() < 10, rtc.getMonth() + 1 < 10);

                    char line1[LCD_COLUMNS + 1];
                    char line2[LCD_COLUMNS + 1];

                    sprintf(line1, fmt1.c_str(), rtc.getHour(true), rtc.getMinute());
                    sprintf(line2, fmt2.c_str(), rtc.getDay(), rtc.getMonth() + 1, rtc.getYear());

                    Serial.println(line1);
                    Serial.println(line2);
                    Serial.print("\n");
                }
            }
            else if (!dataCheck)
            {
                ld.accessQueue()->enqueue(LcdMsg("UPD config-data ", "via application ", 1, 1));
                Serial.println("Device data is not updated!");
            }
        }
        else
        {
            if (!startupLog)
            {
                sprintf(outputBuffer, "{\\\"msg\\\":\\\"IntelliDose~%s has begun operation\\\"}", deviceIdBase64.c_str());

                httpsCreateEventViaPOST("LOG", String(outputBuffer), 0);
                startupLog = true;

                ld.accessQueue()->enqueue(LcdMsg(" Device - fully ", "  operational!   ", 1, 1));
            }

            if (ds.checkSeq())
            {
                // ds.displaySequence();
                ds.dispence();
            }
            else if (!RFID_req)
            {
                if (rm.isNewCardRead())
                {
                    rm.readUid();

                    String RFID_data = rm.getCachedUid();

                    char line[LCD_COLUMNS + 1];
                    sprintf(line, "    %s    ", RFID_data);
                    ld.accessQueue()->enqueue(LcdMsg("   Tag read:    ", line, 1, 1));

                    sprintf(outputBuffer, "Approached UUID: %s - ", rm.getCachedUid());
                    Serial.print(outputBuffer);

                    checkSchedule(rm.getCachedUid());
                }
            }
        }
    }
    else
    {
        Serial.println("Provide WiFi details!");
        ld.accessQueue()->enqueue(LcdMsg("  Awaiting WiFi ", "     details    ", 1, 1));
    }

    if (id.getArmed())
    {
        id.detect();

        switch (id.check())
        {
        case PICKUP_SUCCESS:
            pd.stopBuzz();

            Serial.println("Med-s were picked up!\n");
            ld.accessQueue()->enqueue(LcdMsg(" Healthier with ", "   IntelliDose  ", 1, 1));

            break;

        case MECHANISM_FAILURE_STOP:
            Serial.println("Mechanism failure!\n");
            ld.accessQueue()->enqueue(LcdMsg(" Mechanism fai- ", " lure reported! ", 1, 1));

            httpsCreateEventViaPOST("LOG", "{\\\"msg\\\":\\\"During the dispensing procedure, a mechanism failure occurred in the device!\\\"}", 0);

            break;

        case PICKUP_FAILURE:
            pd.initBuzz();

            Serial.println("Meds are not picked up!");
            ld.accessQueue()->enqueue(LcdMsg("    Take your   ", "    medicine!   ", 1, 1));

            break;

        case PICKUP_FAILURE_STOP:
            pd.stopBuzz();

            Serial.println("STOP! (Med-s were not picked up)\n");

            httpsCreateEventViaPOST("LOG", "{\\\"msg\\\":\\\"The dispensed medicine was not picked up!\\\"}", 0);

        default:
            break;
        }
    }

    if (rm.getCachedUid() != "")
    {
        rm.clearCachedUid();
    }

    if (ld.accessQueue()->getQueueSize() == 0)
    {
        std::string fmt1 = getTimeFmt(rtc.getHour(true) < 10, rtc.getMinute() < 10);
        std::string fmt2 = getDateFmt(rtc.getDay() < 10, rtc.getMonth() + 1 < 10);

        char line1[LCD_COLUMNS + 1];
        char line2[LCD_COLUMNS + 1];

        sprintf(line1, fmt1.c_str(), rtc.getHour(true), rtc.getMinute());
        sprintf(line2, fmt2.c_str(), rtc.getDay(), rtc.getMonth() + 1, rtc.getYear());

        ld.accessQueue()->enqueue(LcdMsg(line1, line2, 1, 1));
    }

    ld.update();
    pd.buzz();

    delay(1000);
}

void bluetoothReqHandler(String reqString)
{
    char serializedData[DD_TRANSM_SIZE];

    reqString.replace("\n", "");
    reqString.trim();
    reqString.remove(0, 1);
    reqString.toCharArray(serializedData, DD_TRANSM_SIZE);

    json.clear();
    DeserializationError err = deserializeJson(json, serializedData);

    if (err)
    {
        Serial.print(F("deserializeJson() failed with code "));
        Serial.println(err.f_str());
        Serial.println("\n");

        return;
    }

    int reqCode = json["reqCode"];
    JsonObject payload = json["payload"];

    switch (reqCode)
    {
    case BT_DUID_GET_REQ:
    {
        String response = "\"{\"resCode\":" + String(BT_DUID_GET_REQ) + ",\"payload\":{\"deviceIdBase64\":\"" + String(deviceIdBase64.c_str()) + "\"}}\"";
        SerialBT.println(response);

        ld.accessQueue()->enqueue(LcdMsg(" Responded with ", " device's UUID  ", 1, 1));

        Serial.println("Responded with device's UUID\n");
    }
    break;

    case BT_RFID_GET_REQ:
    {
        RFID_req = true;

        ld.accessQueue()->enqueue(LcdMsg("  RFID reading  ", "   requested    ", 1, 1));
        ld.accessQueue()->enqueue(LcdMsg("    Approach    ", "    your tag    ", 1, 1));

        Serial.println("RFID reading requset detected");
    }
    break;

    case BT_WIFI_SET_REQ:
    {
        strcpy(ssid, payload["ssid"]);
        strcpy(pass, payload["pass"]);

