prenaissance/pbl_iot_team6/device-soft/ESP32/src/main.cpp
        Serial.println("WiFi details received\n");
    }
    break;

    case BT_DATA_UPD_REQ:
    {
        Serial.println("Data upd requested");
        httpsDataUpd();
    }
    break;

    default:
        Serial.println("Unrecognized Bluetooth request!\n");

        break;
    }
}

void checkSchedule(String userRFID)
{
    char line1[LCD_COLUMNS + 1];
    char line2[LCD_COLUMNS + 1];

    bool found = false;

    Profile *pProf = deviceData.getProfile(userRFID);

    Serial.println(pProf->getUN());

    if (pProf != nullptr)
    {
        std::string fmt = getTimeFmt(rtc.getHour(true) < 10, rtc.getMinute() < 10);
        sprintf(line1, fmt.c_str(), rtc.getHour(true), rtc.getMinute());

        String nameFmt;
        for (int i = 0; i < (LCD_COLUMNS - strlen(pProf->getUN())) / 2; i++)
        {
            nameFmt += ' ';
        }
        nameFmt += "%s";

        sprintf(line2, nameFmt.c_str(), pProf->getUN());

        ld.accessQueue()->enqueue(LcdMsg(line1, line2, 1, 1));
        ld.update();

        for (int i = 0; i < pProf->getSchedLen(); i++)
        {
            ScheduleItem *pItem = pProf->getItem(i);

            if (pItem->checkTime(rtc.getHour(true), rtc.getMinute(), 180))
            {
                if (pItem->getFulfileld())
                {
                    sprintf(outputBuffer, "%d:%d schedule item for %s  was already fulfilled today!", pItem->getTimeH(), pItem->getTimeM(), pProf->getUN());
                    Serial.println(outputBuffer);

                    ld.accessQueue()->enqueue(LcdMsg(line1, "   FULFILLED    ", 1, 1));

                    continue;
                }
                else
                {
                    found = true;

                    PillSlot *pSlot = deviceData.getPillSlot(pItem->getSlotNum());

                    if (pSlot == nullptr)
                    {
                        Serial.println("Slot not found!");
                        continue;
                    }
                    else
                    {
                        ld.accessQueue()->enqueue(LcdMsg("    Logging      ", " the operation  ", 1, 1));
                        ld.update();

                        for (int j = 0; j < pItem->getQuantity(); j++)
                        {
                            if (!pSlot->checkPillCnt())
                            {
                                sprintf(outputBuffer, "{\\\"msg\\\":\\\"The slot #%d has run out of supplies!\\\"}", pItem->getSlotNum());
                                httpsCreateEventViaPOST("LOG", outputBuffer, 0);

                                break;
                            }
                            else
                            {
                                ds.pushToSeq(pItem->getSlotNum());
                                id.arm();

                                pSlot->decPillCnt();
                                pItem->check();

                                sprintf(outputBuffer, "{\\\"msg\\\":\\\"x1 %s provided to %s\\\"}", pSlot->getPillName(), pProf->getUN());
                                httpsCreateEventViaPOST("LOG", outputBuffer, pProf->getProfileId());

                                // if (!pSlot->checkPillCnt())
                                // {
                                //     sprintf(outputBuffer, "{\\\"msg\\\":\\\"The slot #%d has run out of supplies!\\\"}", pItem->getSlotNum());
                                //     httpsCreateEventViaPOST("LOG", outputBuffer, 0);
                                // }
                            }
                        }

                        lm.update(pSlot->getPillCnt(), pItem->getSlotNum() - 1);
                    }
                }
            }
        }
    }

    if (!found)
    {
        Serial.println("No profile / available schedule items found!\n");
    }
}

bool httpTimeUpd()
{
    if (!switchToWiFi())
    {
        Serial.println("IP lookup failed due to WiFi connection failure!\n");
        ld.accessQueue()->enqueue(LcdMsg("  FAILED due to ", "WiFi con. issues", 1, 1));
        return false;
    }

    Serial.println(" Connected successfully!");

    char url[100];
    sprintf(url, TIME_SRC, ipStr);

    client.begin(url);
    int httpResCode = client.GET();

    if (httpResCode >= 200 && httpResCode < 300)
    {
        json.clear();
        DeserializationError err = deserializeJson(json, client.getString());

        if (err)
        {
            ld.accessQueue()->enqueue(LcdMsg("    Operation   ", "     FAILED!    ", 1, 1));
            sprintf(outputBuffer, "Time update: deserializeJson() failed - %s!", err.c_str());
            Serial.println(outputBuffer);
            return false;
        }

        String datetime = json["datetime"];

        struct DateTime
        {
            int year;
            int month;
            int day;
            int hour;
            int minute;
            int second;
            int ms;
            int offsetHrs;
        };

        DateTime dt;
        int pc = sscanf(
            datetime.c_str(),
            "%d-%d-%dT%d:%d:%d.%d+%d:00",
            &dt.year, &dt.month, &dt.day, &dt.hour, &dt.minute, &dt.second, &dt.ms, &dt.offsetHrs);

        if (pc == 8)
        {
            rtc.setTime(dt.second, dt.minute, dt.hour, dt.day, dt.month, dt.year);
            rtc.offset = 0;

            ld.accessQueue()->enqueue(LcdMsg("  Time updated  ", "  successfully! ", 1, 1));
            Serial.println("Time update: Time successfully updated");
        }
        else
        {
            ld.accessQueue()->enqueue(LcdMsg("    Operation   ", "     FAILED!    ", 1, 1));
            Serial.println("Time update: Error parsing datetime string!");
            return false;
        }
    }
    else
    {
        ld.accessQueue()->enqueue(LcdMsg("    Operation   ", "     FAILED!    ", 1, 1));
        sprintf(outputBuffer, "Time update: Error on HTTP request - %s!", client.errorToString(httpResCode));
        Serial.println(outputBuffer);
    }

    client.end();
    switchToBT();

