prenaissance/pbl_iot_team6/device-soft/ESP32/src/main.cpp
    return true;
}

void httpsDataUpd()
{
    if (!switchToWiFi())
    {
        Serial.println("Data update failed due to WiFi connection failure!\n");
        ld.accessQueue()->enqueue(LcdMsg("  FAILED due to ", "WiFi con. issues", 1, 1));
        return;
    }

    Serial.println(" Connected successfully!");

    ld.accessQueue()->enqueue(LcdMsg("   Updating...  ", "", 1, 1));
    ld.update();

    char url[100];
    sprintf(url, DEVICE_COMMON_ROUTE_PART, deviceIdBase64.c_str());
    strcat(url, DATA_ENDPOINT_PART);

    client.begin(wsClient, url);
    int httpResCode = client.GET();

    if (httpResCode >= 200 && httpResCode < 300)
    {
        json.clear();
        DeserializationError err = deserializeJson(json, client.getString());

        if (err)
        {
            ld.accessQueue()->enqueue(LcdMsg("    Operation   ", "     FAILED!    ", 1, 1));
            sprintf(outputBuffer, "deserializeJson() failed: %s", err.c_str());
            Serial.println(outputBuffer);

            return;
        }

        saveData(json.as<JsonObject>());

        deviceData.status();

        ld.accessQueue()->enqueue(LcdMsg("Config-data upd.", "  successfully! ", 1, 1));
        Serial.println("Data update: Device data successfully updated");
    }
    else
    {
        ld.accessQueue()->enqueue(LcdMsg("    Operation   ", "     FAILED!    ", 1, 1));
        sprintf(outputBuffer, "Data update: Error on HTTPS request - %s!", client.errorToString(httpResCode));
        Serial.println(outputBuffer);
    }

    client.end();
    switchToBT();
}

void httpsCreateEventViaPOST(String eventType, String eventData, unsigned int profileId)
{
    if (!switchToWiFi())
    {
        Serial.println("Event posting failed due to WiFi connection failure!\n");
        return;
    }

    Serial.println(" Connected successfully!");

    char url[100];
    sprintf(url, DEVICE_COMMON_ROUTE_PART, deviceIdBase64.c_str());
    strcat(url, EVENT_ENDPOINT_PART);

    char reqBody[400];
    sprintf(reqBody, EVENT_FMT, eventType.c_str(), eventData.c_str());

    if (profileId > 0)
    {
        char trailer[20];
        sprintf(trailer, EVENT_ASSIGNMENT_TRAILER, profileId);

        reqBody[strlen(reqBody) - 1] = ',';
        strcat(reqBody, trailer);
    }

    Serial.print("POST event: ");
    Serial.println(String(reqBody));

    client.begin(wsClient, url);
    client.addHeader("Content-Type", "application/json");

    int httpResCode = client.POST(String(reqBody));

    if (httpResCode >= 200 && httpResCode < 300)
    {
        Serial.println("Event posting: Success");
    }
    else
    {
        sprintf(outputBuffer, "Event posting: Error on HTTPS request - %d!", httpResCode);
        Serial.println(outputBuffer);
    }

    client.end();
    switchToBT();
}

void httpsCreateEventViaGET(String eventType, String eventData, unsigned int profileId)
{
    if (!switchToWiFi())
    {
        Serial.println("Event posting via GET failed due to WiFi connection failure!\n");
        return;
    }

    Serial.println(" Connected successfully!");

    char url[500];
    sprintf(url, DEVICE_COMMON_ROUTE_PART, deviceIdBase64.c_str());
    strcat(url, EVENT_ENDPOINT_PART);

    char params[400];

    sprintf(params, CREATE_EVENT_PARAMS_FMT, eventType.c_str(), eventData.c_str());

    String translatedParams = String(params);

    translatedParams.replace("{", "%7B");
    translatedParams.replace("}", "%7D");
    translatedParams.replace("\"", "%22");
    translatedParams.replace(":", "%3A");
    translatedParams.replace(" ", "%20");

    strcpy(params, translatedParams.c_str());

    if (profileId > 0)
    {
        char trailer[20];
        sprintf(trailer, CREATE_EVENT_PARAMS_FMT_TRAILER, profileId);

        strcat(params, trailer);
    }

    strcat(url, params);

    client.begin(url);
    int httpResCode = client.GET();

    if (httpResCode >= 200 && httpResCode < 300)
    {
        Serial.println("Event posting via GET: Success");
    }
    else
    {
        sprintf(outputBuffer, "Event posting via GET: Error on HTTPS request - %d!", httpResCode);
        Serial.println(outputBuffer);
    }

    client.end();
    switchToBT();
}

void saveData(JsonObject payload)
{
    deviceData = DeviceData();

    // Record pill slots

    JsonArray pillSlots = payload["pillSlots"];
    for (JsonObject pillSlot : pillSlots)
    {
        int slotNumber = pillSlot["slotNumber"];
        const char *pillName = pillSlot["pillName"];
        int pillCount = pillSlot["pillCount"];

        deviceData.addPillSlot(PillSlot(pillName, pillCount), slotNumber);
        lm.update(pillCount, slotNumber - 1);
    }

    // Record profiles and their schedules

    JsonArray profiles = payload["profiles"];
    for (JsonObject profile : profiles)
    {
        unsigned int profileId = profile["profileId"];
        const char *username = profile["username"];
        const char *RFID_UID = profile["rfid"];

        deviceData.addProfile(Profile(profileId, username, RFID_UID));

        Profile *pProf = deviceData.getProfile(String(RFID_UID));

        JsonArray pillSchedules = profile["pillSchedules"];
        for (JsonObject pillSchedule : pillSchedules)
        {
            int hour = pillSchedule["time"]["hour"];
            int minute = pillSchedule["time"]["minutes"];
            int slotNumber = pillSchedule["slotNumber"];
            int quantity = pillSchedule["quantity"];

            pProf->addItem(ScheduleItem(hour, minute, slotNumber, quantity));
        }
    }
}

void pubIP_lookup()
{
    if (!switchToWiFi())
    {
        Serial.println("IP lookup failed due to WiFi connection failure!\n");
        ld.accessQueue()->enqueue(LcdMsg("  FAILED due to ", "WiFi con. issues", 1, 1));
        return;
    }

    Serial.println(" Connected successfully!");

    client.begin(PUB_IP_LOOKUP);
    int httpResCode = client.GET();

    if (httpResCode > 0)
    {
        strcpy(ipStr, client.getString().c_str());

        ld.accessQueue()->enqueue(LcdMsg("  IP retrieved  ", "  successfully! ", 1, 1));
        sprintf(outputBuffer, "Public IP address lookup: success - %s", ipStr);
        Serial.println(outputBuffer);
    }
    else
    {
        ld.accessQueue()->enqueue(LcdMsg("    Operation   ", "     FAILED!    ", 1, 1));
        sprintf(outputBuffer, "Public IP lookup: Error on HTTP request - %s!", client.errorToString(httpResCode));
        Serial.println(outputBuffer);
    }

    client.end();
    switchToBT();
}

bool switchToWiFi()
{
    sprintf(outputBuffer, "Disabling BT... connecting to %s: ..", ssid);
    Serial.print(outputBuffer);

    SerialBT.end();

    lastConAtt = millis();
    conTimer = 0;

    WiFi.mode(WIFI_STA);
    WiFi.begin(ssid, pass);

    while (WiFi.status() != WL_CONNECTED)
    {
        delay(250);

        Serial.print(".");

        conTimer += millis() - lastConAtt;
        lastConAtt = millis();

        if (conTimer > WIFI_CONNECT_TIMEOUT)
        {
            memset(ssid, '\0', sizeof(ssid));
            memset(pass, '\0', sizeof(pass));

            Serial.println("Attempt timed out - WiFi details erased! Restarting BT");

            WiFi.disconnect(true);
            WiFi.mode(WIFI_OFF);

            SerialBT.begin(BT_DEVICE);

            return false;
        }
    }

    return true;
}

void switchToBT()
{
    WiFi.disconnect(true);
    WiFi.mode(WIFI_OFF);

    Serial.println("WiFi disabled, restarting BT\n");

    SerialBT.begin(BT_DEVICE);
}